*** ESS
#+begin_src elisp
(use-package ess
  :init
  (require 'ess-site)
  (require 'ess-r-mode)

  ;; written by chatGPT
(defun my-switch-to-R-process ()
  (interactive)
  (let* ((r-buffers (seq-filter (lambda (buf) 
                                  (let ((proc (get-buffer-process buf)))
                                    (when proc
                                      (string= "R" (process-name proc)))))
                                (buffer-list)))
         (num (length r-buffers))
         (current-buff-pos (cl-position (current-buffer) r-buffers)))
    (if r-buffers
        (switch-to-buffer (if current-buff-pos 
                              (nth (mod (+ current-buff-pos 1) num) r-buffers) 
                            (car r-buffers)))
      (message "No R buffers exist"))))

  (defun ess-insert-pipe ()
    ;; Insert a "%<%" symbol with smart spacing.
    (interactive)
    (cycle-spacing)
    (insert "%>%")
    (if (not (eolp))
	(cycle-spacing)))
      
  (defun ess-insert-gets ()
    ;; Insert a "<-" symbol with smart spacing.
    (interactive)
      (cond (
	     ;; If point is at the beginning of a line
	     (bolp)
	     (cycle-spacing)
	     (insert "<-")
	     (cycle-spacing)
	     (beginning-of-line))
	    
	    ;; If point is at the beginning of indentation
	    ((boip)
	     (save-excursion
	       (insert " <-")
	       (cycle-spacing)))
	    
	    ;; Else
	    (t
	     (cycle-spacing)
	     (insert "<-")
	     (cycle-spacing))))

  (defun my-inferior-ess-init ()
    (setq-local ansi-color-for-comint-mode 'filter))

  ;; Start R processes with the name of the active buffer
  (defun R (&optional start-args)
    (interactive "P")
    ;; Get the name of the active buffer
    (let ((buffer-name (buffer-name)))
      ;; Start the R process
      (set-buffer (run-ess-r start-args))
      ;; Rename the process buffer based on the active buffer's name
      (rename-buffer (concat "*R: " buffer-name "*") t)))

  
  :config
  (setq ess-history-file nil)
  (define-key ess-r-mode-map (kbd "C-M-p") 'ess-insert-pipe)
  (define-key ess-r-mode-map (kbd "C-'") 'ess-insert-gets)
  (define-key inferior-ess-r-mode-map (kbd "C-M-p") 'ess-insert-pipe)
  (define-key inferior-ess-r-mode-map (kbd "C-'") 'ess-insert-gets)

  ;; :bind (:map ess-r-mode
  ;;  	      ("C-M-p" . mp-ess-insert-pipe))
  :hook (inferior-ess-r-mode . my-inferior-ess-init)
  :hook (ess-mode . auto-composition-mode)
  :hook ((ess-mode . (lambda ()
                      (flymake-mode 0)
                      (setq ess-use-flymake nil)
                      (flycheck-mode 0)
                      ))))

  ;; :hook (ess-mode . flycheck-mode)

#+end_src

#+RESULTS:
| flycheck-mode | auto-composition-mode |
|               |                       |
* Global key bindings
#+begin_src elisp
(define-key emacs-lisp-mode-map (kbd "<C-return>") 'eval-region-confirm)
;; (global-set-key (kbd "M-i") 'imenu)
;; (global-set-key (kbd "M-O") 'ace-window)
;; (global-set-key (kbd "M-o") 'other-window)

;; Normally, suspend frame
(global-set-key (kbd "C-z") 'switch-to-last-buffer)

(global-set-key (kbd "-") 'insert-delimiter)
(global-set-key (kbd "C--") 'insert-dash)

(global-set-key (kbd "C-x /") 'global-copilot-mode)

;; (global-set-key (kbd "M-S-q") 'unfill-paragraph)

;; (global-set-key (kbd "C-c c") 'counsel-org-capture)
;; (global-set-key (kbd "C-x b") 'ivy-switch-buffer) 
;; (global-set-key (kbd "C-c z") 'counsel-fzf)

;; (global-set-key (kbd "C-c C-b") 'eval-buffer)

;; (global-set-key (kbd "C-c B") 'list-bookmarks)
(global-set-key (kbd "C-c n") 'show-file-name)
(global-set-key (kbd "C-x K") 'kill-current-buffer)
(global-set-key (kbd "C-;") 'comment-line)
;; (global-set-key (kbd "C-x ;") 'comment-or-uncomment-region)
;; (global-set-key (kbd "C-x C-;") 'comment-box)
;; (global-set-key (kbd "C-0") 'end-of-buffer)
;; (global-set-key (kbd "C-9") 'beginning-of-buffer)
(global-set-key (kbd "C-x C-p") 'replace-string)

(global-set-key (kbd "C-x X") 'compile)
(global-set-key (kbd "C-x C-g") 'revert-buffer)

;; (global-set-key (kbd "C-M-y") 'counsel-yank-pop)

(global-set-key (kbd "M-n") 'forward-paragraph)
(global-set-key (kbd "M-p") 'backward-paragraph)

(global-set-key (kbd "C-x C-b") 'ibuffer)

;; (global-set-key (kbd "C-S-d") 'pyvenv-restart-python)
(message "Global keys bound.")
; (global-set-key (kbd "C-x 4") 'mp-split-window-4)
#+end_src

#+RESULTS:
: Global keys bound.

